# Parameter Filter Rule Factory Create Begins With Rule Method

Source: https://www.revitapidocs.com/2026/21ed4118-6602-68d0-252b-7dd58ee88b57.htm

---

| Parameter Filter Rule Factory Create Begins With Rule Method |
| --- |

Creates a filter rule that determines whether strings from the document
 begin with a certain string value.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FilterRule CreateBeginsWithRule(
	ElementId parameter,
	string value
)
```

```
Public Shared Function CreateBeginsWithRule (
	parameter As ElementId,
	value As String
) As FilterRule
```

```
public:
static FilterRule^ CreateBeginsWithRule(
	ElementId^ parameter,
	String^ value
)
```

```
static member CreateBeginsWithRule :
        parameter : ElementId *
        value : string -> FilterRule
```

#### Parameters

parameter ElementId
:   A string\-typed parameter used to get values from the document for a given element.

value String
:   The user\-supplied string value for which values from the document will be searched.

#### Return Value

FilterRule
Created filter rule object. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace